Config = {
	ModFile = "./data/moderation.json",
	
	GeneralSudoId = 246212075, -- محل قرار دادن آيدي سودوي اصلي جهت دریافت گزارشات ربات
	SudoUsers = {372609620,288155430,243411882,184496396,338765092,350647688,442616528,447661755}, -- محل قرار دادن آيدي سودو هاي ربات
	SudoUsername = "@Evima", -- يوزرنيم مدير اصلي ربات با @
	
	AntiSpamBotId = 399346810, -- محل قرار دادن آيدي ربات ضد تبليغات اصلي
	
	ApiBotId = 382253347, -- محل قرار دادن آيدي ربات هلپر
	ApiBotToken = "382253347:AAEaFUcZPsWG57of05G4UKdmbyLPBkuHfKo", -- محل قرار دادن توکن ربات هلپر
	
	SupportBot = "@accounte_bot", -- محل قرار دادن يوزرنيم ربات پشتيباني در صورت وجود - (اگر ربات پشتيباني نداريد، يوزرنيم ربات سودو رو قرار بديد)
	Channel = "@AFGBOTS", -- محل قرار دادن آيدي کانال با @ - [Example : @EnigmaTM]
	
	RedisIndex = 0 -- شمار رديس را در اينجا قرار دهيد (اگر نميدونيد جيه تغيير نديد) --> Redis:Select ...
}

return Config
