function getHelp(Key)

if Key == "HelpList" then
	HelpList = [[
💠 لیست آموزش های ربات :

👈 راهنمای قفل
`مربوط به قفل های بات ، دریافت تنظیمات و ...`

 👈 راهنمای مدیریتی
`مربوط به مدیریت ربات در گروه`

👈 راهنمای مسدود
`مربوط به مسدود ، سایلنت و ... کاربران در گروه`

👈 راهنمای فان
`مربوط به امکانات فان و اضافی ربات ...`


✓ برای دریافت هر آموزش عبارت آن را تایپ کنید .
برای مثال : راهنمای قفل

————————
⏺ نکاتی درباره راهنما ربات :
1- در راهنما دستورات انگلیسی و پارسی قرار دارند.
2- نوشته های `{یوزرنیم/ایدی/ریپلای}` و `{Username/ID/Reply}` در راهنما بدین معناست که آن دستور از طریق [نام کاربری ، ریپلای و شناسه کاربری] کاربر قابل انجام است.
]]
	return HelpList
	
elseif Key == "LocksHelp" then
	LocksHelp = [[
✳️ راهنمای قفل های ربات

قفل لینک
بازکردن لینک
🔹فعال و غیرفعال کردن قفل لینک
———————————
قفل ادیت
بازکردن ادیت
🔹فعال و غیرفعال کردن قفل ادیت(ویرایش) پیام
———————————
نمایش ادیت
🔹فعال و غیرفعال کردن نمایش پیامی که در گروه ادیت میشود.
———————————
قفل فروارد
بازکردن فروارد
🔹فعال و غیرفعال کردن قفل فروارد پیامها
———————————
قفل کیبورد
بازکردن کیبورد
🔹فعال و غیرفعال کردن قفل کیبورد شیشه ای
———————————
قفل دستورات
بازکردن دستورات
🔹فعال و غیرفعال کردن قفل دستورات. اگر این قفل فعال باشد ، ربات به سری دستور هایی که برای کاربران عادی قابل استفاده است (مانند /id)  پاسخ نمیدهد ، به عبارتی فقط مدیران اصلی و فرعی میتوانند از ربات استفاده کنند.
———————————
قفل اسپم
بازکردن اسپم
🔹فعال و غیرفعال کردن قفل پیام های طولانی
———————————
قفل ربات
بازکردن ربات
🔹فعال و غیرفعال کردن قفل ورود و استفاده از ربات های API ، ربات به محض ورود اخراج میگردد.
———————————
قفل رگباری
بازکردن رگباری
🔹فعال و غیرفعال کردن اخراج کاربر در صورت ارسال پیام در گروه بصورت رگباری

تنظیم رگباری (عدد)
🔹برای تنظیم حساسیت پیام رگباری کافیست به جای (عدد) ، یکی از اعداد 5 تا 20 را قرار دهید.

تنظیم رگباری {اخراج / حذف پیام}
🔹تنظیم عملکرد ربات در پیام رگباری
———————————
قفل خدمات
بازکردن خدمات
🔹فعال و غیرفعال کردن حذف پیام های ورود و خروج
———————————
قفل انگلیسی
بازکردن انگلیسی
🔹فعال و غیرفعال کردن قفل انگلیسی نویسی
———————————
قفل عربی
بازکردن عربی
🔹فعال و غیرفعال کردن قفل عربی/پارسی نویسی
———————————
قفل یوزرنیم
بازکردن یوزرنیم
🔹فعال و غیرفعال کردن قفل یوزرنیم (@)
———————————
قفل تگ
بازکردن تگ
🔹فعال و غیرفعال کردن قفل تگ (#)
———————————
قفل متن
بازکردن متن
🔹فعال و غیرفعال کردن قفل ارسال متن
———————————
قفل استیکر
بازکردن استیکر
🔹فعال و غیرفعال کردن قفل استیکر
———————————
قفل صدا
بازکردن صدا
🔹فعال و غیرفعال کردن قفل صدا و ویس
———————————
قفل عکس
بازکردن عکس
🔹فعال و غیرفعال کردن قفل عکس
———————————
قفل ویدیو
بازکردن ویدیو
🔹فعال و غیرفعال کردن قفل ویدیو
———————————
قفل فایل
بازکردن فایل
🔹فعال و غیرفعال کردن قفل فایل(*Document*)
———————————
قفل مخاطب
بازکردن مخاطب
🔹فعال و غیرفعال کردن قفل ارسال مخاطب
———————————
قفل سخت
بازکردن سخت
🔹فعال و غیرفعال کردن قفل سخت (وقتی این قفل فعال است ، اگر قفل لینک فعال باشد و کاربری عادی در گروه لینکی بفرستد آن کاربر اخراج خواهد شد.)
———————————
قفل چت
بازکردن چت
🔹فعال و غیرفعال کردن قفل چت (اگر این قفل فعال باشد هر گونه مطلب ارسالی در گروه توسط کاربران عادی ، حذف خواهد شد.)
———————————
قفل خوشامد
بازکردن خوشامد
🔹فعال و غیرفعال کردن خوشامد گویی به کاربران تازه وارد به گروه
———————————
قفل مخاطب
بازکردن مخاطب
🔹فعال و غیرفعال کردن خداحافظی از کاربرانی که از گروه میروند.
———————————
تنظیمات
⭕️ دریافت تنظیمات گروه (نمایش وضعیت فقل ها و تاریخ انقضای گروه)
———————————
]]
	return LocksHelp

elseif Key == "BanHelp" then
	BanHelp = [[
✳️ راهنمای مسدود کردن ، ریپورت و سایلنت کردن کاربران
———————————
مسدود _{یوزرنیم/ایدی/ریپلای}_
/ban _{Username/ID/Reply}_
🔹مسدود و یا رفع مسدود یک کاربر از گروه
`توضیح : وقتی این دستور را اجرا میکنید 2 حالت پیش میاید : حالت اول این است که کاربر مورد نظر شما تا به حال مسدود نشده باشد ، در این صورت این کاربر مسدود شده و در صورتی که در گروه حضور داشته باشد اخراج میشود. حالت دوم این است که کاربر از قبل مسدود شده باشد ، در این حالت این کاربر از لیست کاربران مسدود حذف شده و اجازه ی ورود به گروه را دریافت میکند.`


پاکسازی لیست مسدود
/clean banlist
🔹خالی کردن لیست افرادی که از گروه مسدود شده اند.
———————————
سایلنت _{یوزرنیم/ایدی/ریپلای}_
/silent _{Username/ID/Reply}_
🔹سایلنت کردن و یا رفع سایلنت یک کاربر در گروه
`توضیح : وقتی این دستور را اجرا میکنید 2 حالت پیش میاید : حالت اول این است که کاربر مورد نظر شما تا به حال سایلنت نشده باشد ، در این صورت این کاربر سایلنت شده و هر گونه پیامی که از طرف ایشان در گروه ارسال شود پاک خواهد شد(اجازه چت از او سلب میشود). حالت دوم این است که کاربر از قبل سایلنت شده باشد ، در این حالت این کاربر از لیست کاربران سایلنت شده حذف میشود و اجازه چت در گروه را دریافت میکند.`


پاکسازی لیست سایلنت
/clean silentlist
🔹خالی کردن لیست کاربران سایلنت شده در گروه
———————————
اخراج _{یوزرنیم/ایدی/ریپلای}_
/kick _{Username/ID/Reply}_
🔹اخراج یک کاربر از گروه
———————————
ریپورت _{ریپلای}_
/report _{Reply}_
🔹ریپورت کردن یک کاربر
———————————
]]
	return BanHelp

elseif Key == "FunHelp" then
	FunHelp = [[
✳️ راهنمای فان :
➖➖➖➖
زمان
/time
🔹دریافت زمان و تاریخ شمسی و میلادی
—————————
تاریخ
/date
🔹دریافت اطلاعات کاملی از تاریخ شمسی
—————————
گیف (فونت) (متن)
/gif (font) (word)
🔹ساخت گیف
`به جای (فونت) ، فونت مورد نظر خود را قرار دهید. فونت ها : `
`text - dazzle - prohibited - start - wag - glitter - bliss - flasher - roman - blue - random`
`به جای (متن) ، کلمه یا متن مورد نظر خودتون رو برای ساخت گیف وارد کنید.`
—————————
کوتاه (لینک)
/short (link)
🔹کوتاه کردن لینک مورد نظر شما
—————————
ترجمه (متن)
/tr (word)
🔹ترجمه متن انگلیسی به فارسی
—————————
زیباسازی (متن)
/beauty (word)
🔹زیباسازی متن با بیش از 50 فونت
`توضیح : به جای (متن) ، عبارت مورد نظر خودتونو برای زیباسازی بنویسید.`
—————————
هوا (شهر)
/weather (city)
🔹دریافت آب و هوای شهر مورد نظر
```توضیح : بجای (شهر) ، نام شهر مورد نظر خود را به انگلیسی بنوسید. برای مثال : ```
> `هوا tehran`
—————————
]]
	return FunHelp

elseif Key == "ModerationHelp" then
	ModerationHelp = [[
✳️ راهنمای مدیریتی گروه

ایدی _{یوزرنیم/ریپلای/آیدی}_
/id _{Username/Reply/ID}_
🔹دریافت اطلاعات یک شخص
———————————
کیست _{یوزرنیم/ریپلای/آیدی}_
/who _{Username/Reply/ID}_
🔹دریافت اطلاعات یک شخص
———————————
اطلاعات گروه
/gpinfo
🔹دریافت اطلاعات گروه
———————————
پین _{ریپلای}_
/pin _{Reply}_
🔹پین کردن پیام در گروه

آنپین
/unpin
🔹آنپین کردن پیام پین شده
———————————
ترفیع _{یوزرنیم/ریپلای/آیدی}_
/promote _{Username/Reply/ID}_
🔹تنظیم یک کاربر به عنوان مدیر فرعی ربات (مخصوص مدیر اصلی)
`توضیح : این دستور هم ترفیع میدهد و هم عزل میکند! یعنی اگر کاربر در حال حاضر مدیر فرعی باشد او را عزل میکند و اگر نباشد او را ترفیع میدهد و به مدیر فرعی ربات در گروه او را ارتقا خواهد داد.`

لیست مدیران فرعی
/modlist
🔹دریافت لیست مدیران فرعی ربات در گروه

پاکسازی لیست مدیران فرعی
/clean modlist
🔹پاکسازی لیست مدیران فرعی ربات در گروه
—-------------
تنظیم لینک
/setlink
🔹تنظیم لینک گروه برای ربات

لینک
/link
🔹دریافت لینک تنظیم شده گروه

پاکسازی لینک
/clean link
🔹حذف لینک تنظیم شده گروه
———————————
پینگ
/ping
🔹دریافت اطلاعات ربات و وضعیت آنلاینی
———————————
فیلتر (عبارت)
/filter (word)
🔹فیلتر کردن یک کلمه در گروه
`توضیح : برای فیلتر کردن عبارت دلخواه کافی است تا به جای (عبارت) ، کلمه و یا عبارت مورد نظر خود را قرار دهید `

رفع فیلتر (عبارت)
/rf (word)
🔹رفع فیلتر کردن یک کلمه در گروه
`توضیح : برای رفع فیلتر کردن عبارت دلخواه کافی است تا به جای (عبارت) ، عبارت و یا کلمه مورد نظر خود را قرار دهید. `

لیست فیلتر
/filterlist
🔹دریافت لیست عبارات فیلتر شده در گروه

پاکسازی لیست فیلتر
/clean filterlist
🔹رفع فیلتر کردن تمام کلمات فیلتر شده (مخصوص مدیر اصلی)
———————————
حذف _{ریپلای}_
/del _{Reply}_
🔹حذف یک پیام در گروه با ریپلای
———————————
پاکسازی (عدد)
/rmsg (num)
🔹پاکسازی آخرین چت های ارسالی در گروه
`توضیح : برای پاک کردن آخرین پیام های گروه کافیست به جای (عدد) ، یکی از اعداد 1تا100 را قرار دهید. `
———————————
پاکسازی همه
/cleanall
🔹پاکسازی آخرین چت های ارسالی در گروه تا حد ممکن و تعداد بالا
———————————
پاکسازی ربات ها
/clean bots
🔹اخراج تمامی ربات های معمولی(API) در موجود در گروه
———————————
پاکسازی حذف شده
/clean deleted
🔹اخراج تمامی کاربران Deleted Account از گروه
———————————
/rename (name)
🔹تغییر نام گروه
`توضیح : برای تغییر نام گروه کافیست به جای (اسم) ، نام جدید گروه را قرار دهید. `
———————————
حذف همه _{ریپلای}_
/delall _{Reply}_
🔹حذف تمامی پیام های یک کاربر با ریپلای بر روی یکی از پیامهایش(مخصوص مدیران اصلی)
———————————
مقام من
/myrank
🔹دریافت مقام خود در ربات
———————————
تنظیم قوانین (متن)
/setrules (word)
🔹تنظیم قوانین گروه (به جای `(متن)` ، متن قوانین خود را بنویسید.)

قوانین
/rules
🔹دریافت قوانین تنظیم شده.
———————————
پاکسازی قوانین
/clean rules
🔹حذف متن تنظیم شده برای قوانین گروه
———————————
پاکسازی لیست بلاک
/clean blocklist
🔹خالی کردن لیست بلاکی های گروه و ادد کردن آنها به گروه
———————————
]]
	return ModerationHelp
end

end